feat: add mermaid diagrams (#3)
* feat: update diagrams from markdown to mermaid

* docs: update readme to more easily find analysis

* fix: formatting issues on GitHub
