--- a/communication_analysis.md
+++ b/communication_analysis.md
@@ -89,17 +80,17 @@ In this example we will be running a state machine on remote servers called Alic
 
 When sending the input token $a$ the servers, charlie will generate shares $a_0$ and $a_1$ such that $a = a_0 + a_1$. The share $a_0$ will be sent to Alice the share $a_1$ will be sent to Bob. Because the input shares are from is from the set $\Sigma$, the input shares will be $8$ bits long.
 
-```
-                     ┌──────────────────┐
-              ┌──────┤ Charlie (client) ├──────┐
-              │      └──────────────────┘      │
-              │                                │
-Input Share 0 │                                │ Input Share 1
-              │                                │
-              │                                │
-     ┌────────▼─────────┐             ┌────────▼───────┐
-     │ Alice (server 0) │             │ Bob (server 1) │
-     └──────────────────┘             └────────────────┘
+```mermaid
+flowchart LR
+  subgraph Client
+   Charlie((Charlie))
+  end
+  subgraph Servers
+   Alice((Alice))
+   Bob((Bob))
+  end
+  Charlie -- Input Share 0 --> Alice
+  Charlie -- Input Share 1 --> Bob
 ```
 
 ### Communication: Compute Next State
@@ -109,23 +100,68 @@ In order to compute the next state Alice and Bob must use their current state sh
 To evaluate the next multilinear polynomial Alice and Bob must:
 
 1. Receive precomputed triples from a trusted party
-   ```
-                     ┌───────────────────────┐
-                 ┌───┤ Trent (trusted party) ├────┐
-                 │   └───────────────────────┘    │
-                 │                                │
-   Beaver Triple │                                │  Beaver Triple
-                 │                                │
-        ┌────────▼─────────┐             ┌────────▼───────┐
-        │ Alice (server 0) │             │ Bob (server 1) │
-        └──────────────────┘             └────────────────┘
-   ```
+
+```mermaid
+flowchart LR
+   subgraph TrustedParty[Trusted Party]
+      Trent((Trent))
+   end
+   subgraph Servers
+      Alice((Alice))
+      Bob((Bob))
+   end
+ Trent -- Beaver Triple --> Alice
+ Trent -- Beaver Triple --> Bob
+```
+
 2. Compute the following powers of the current shared state $s$ using the triples (for this example we have to compute $1024$ powers):
    $$s^0 = 1$$
@@ -181,15 +216,17 @@ Instead of sending a share of the input to each server, we will send a DPF key t
 
 <!-- TODO: put DPF size here. The size is found in the paper "Distributed Point Functions and Their Applications"**** -->
 
-```
-                 ┌──────────────────┐
-          ┌──────┤ Charlie (client) ├──────┐
-          │      └──────────────────┘      │
-DPF Key 0 │                                │ DPF Key 1
-          │                                │
- ┌────────▼─────────┐             ┌────────▼───────┐
- │ Alice (server 0) │             │ Bob (server 1) │
- └──────────────────┘             └────────────────┘
+```mermaid
+flowchart LR
+  subgraph Client
+   Charlie((Charlie))
+  end
+  subgraph Servers
+   Alice((Alice))
+   Bob((Bob))
+  end
+  Charlie -- DPF Key 0 --> Alice
+  Charlie -- DPF Key 1 --> Bob
 ```
 
 ### Communication: Compute Next State
@@ -197,17 +234,20 @@ DPF Key 0 │                                │ DPF Key 1
 In order to compute the next state Alice and Bob must use their current state shares as well as the DPF keys. Alice and Bob use MPC to compute the multilinear polynomial. See [this notebook](./optimised_private_state_machine.ipynb) for an example multilinear polynomial representing the transition function $f_a(s)$ (where $a$ is the input and $s$ is the current state). We will complete this MPC computation by using Beavers triples for multiplication. We will assume that these triples are supplied by a trusted third party.
 
 1. Receive precomputed triples from a trusted party
-   ```
-                     ┌───────────────────────┐
-                 ┌───┤ Trent (trusted party) ├────┐
-                 │   └───────────────────────┘    │
-                 │                                │
-   Beaver Triple │                                │  Beaver Triple
-                 │                                │
-        ┌────────▼─────────┐             ┌────────▼───────┐
-        │ Alice (server 0) │             │ Bob (server 1) │
-        └──────────────────┘             └────────────────┘
-   ```
+
+```mermaid
+flowchart LR
+   subgraph TrustedParty[Trusted Party]
+      Trent((Trent))
+   end
+   subgraph Servers
+      Alice((Alice))
+      Bob((Bob))
+   end
+ Trent -- Beaver Triple --> Alice
+ Trent -- Beaver Triple --> Bob
+```
+
 2. Compute the following powers of the current shared state $s$ using the triples (for this example we have to compute $1024$ powers):
    $$s^0 = 1$$
